w4iei/klavecimbelcircuitpython/ports/espressif/boards/espressif_esp32c61_devkitc_1_n8r2/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2019 Scott Shawcroft for Adafruit Industries
//
// SPDX-License-Identifier: MIT

#pragma once

// Micropython setup

#define MICROPY_HW_BOARD_NAME       "ESP32-C61-DevKitC-1-N8R2"
#define MICROPY_HW_MCU_NAME         "ESP32C61"

#define DEFAULT_UART_BUS_RX         (&pin_GPIO10)
#define DEFAULT_UART_BUS_TX         (&pin_GPIO11)
